In [2]:
import pandas as pd
import numpy as np

In [26]:
df = pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row4'],columns=['Column1','Column2','Column3','Column4'])
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row4       16       17       18       19

In [25]:
# Accessing rows
# 1) .loc = row name access of row
# 2) .iloc = index based access of row

print(df.loc['Row1'])
print("************************************")
print(df.iloc[2])

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32
************************************
Column1     8
Column2     9
Column3    10
Column4    11
Name: Row3, dtype: int32

In [33]:
# Convert dataframe to array

df.iloc[1:,1:].values

array([[ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [34]:
df.iloc[1:,1:].values.shape

(4, 3)

In [35]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row4       16       17       18       19

In [36]:
# Count each values

df['Column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Column1, dtype: int64

In [39]:
# Total number of unique values

df['Column1'].nunique()

5

In [40]:
# Prints all unique values

df['Column1'].unique()

array([ 0,  4,  8, 12, 16], dtype=int64)

In [41]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row4       16       17       18       19

In [46]:
# Slicing columns

df.loc[:,"Column1":"Column3"]

      Column1  Column2  Column3
Row1        0        1        2
Row2        4        5        6
Row3        8        9       10
Row4       12       13       14
Row4       16       17       18

In [49]:
# Slicing columns based on index

df.iloc[:,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row4       16       17

### EDA

In [70]:
people = {
    'first': ['Corey','Jane','John','Chris',np.nan,None,'NA'],
    'last': ['Schafer','Jane','Doe','Schafer',np.nan,np.nan,'Missing'],
    'email': ['coreyshafer@email.com','janedoe@email.com','janedoe@email.com',None,np.nan,np.nan,'NA'],
    'age':['33','55',np.nan,'36',None,None,'Missing']
}
df1 = pd.DataFrame(people)
df1

   first     last                  email      age
0  Corey  Schafer  coreyshafer@email.com       33
1   Jane     Jane      janedoe@email.com       55
2   John      Doe      janedoe@email.com      NaN
3  Chris  Schafer                   None       36
4    NaN      NaN                    NaN     None
5   None      NaN                    NaN     None
6     NA  Missing                     NA  Missing

In [72]:
# To Drop all rows that has atleast single None / Nan Values , currently these are the default args
# axis = index : Row 
# how = any : which means in any row if it contains a single nan/none value it will drop

df1.dropna(axis='index',how='any')

   first     last                  email      age
0  Corey  Schafer  coreyshafer@email.com       33
1   Jane     Jane      janedoe@email.com       55
6     NA  Missing                     NA  Missing

In [73]:
# how = all : which means in any row if it contains all null values then it will be dropped

df1.dropna(axis='index',how='all')

   first     last                  email      age
0  Corey  Schafer  coreyshafer@email.com       33
1   Jane     Jane      janedoe@email.com       55
2   John      Doe      janedoe@email.com      NaN
3  Chris  Schafer                   None       36
6     NA  Missing                     NA  Missing

In [75]:
df1

   first     last                  email      age
0  Corey  Schafer  coreyshafer@email.com       33
1   Jane     Jane      janedoe@email.com       55
2   John      Doe      janedoe@email.com      NaN
3  Chris  Schafer                   None       36
4    NaN      NaN                    NaN     None
5   None      NaN                    NaN     None
6     NA  Missing                     NA  Missing

In [78]:
# Column way of missing dropping values

df1.dropna(axis='columns',how='all')

   first     last                  email      age
0  Corey  Schafer  coreyshafer@email.com       33
1   Jane     Jane      janedoe@email.com       55
2   John      Doe      janedoe@email.com      NaN
3  Chris  Schafer                   None       36
4    NaN      NaN                    NaN     None
5   None      NaN                    NaN     None
6     NA  Missing                     NA  Missing